In [2]:
import pandas as pd

## 데이터 불러오기

In [11]:
url = 'http://bit.ly/ds01-weight-history'

# DataFrame
data = pd.read_csv(url, index_col="회차")

print(data.shape)   # print(row,col)
data.head()   # print first 5 rows
data.tail().head().head(3)

(9, 6)

     이름         측정일   몸무게  단위   담당   지점
회차
5   강성희  2019-01-05  76.2  kg  김지수  강남구
6   강성희  2019-01-06  75.7  kg  최재우  여의도
7   강성희  2019-01-07   NaN  kg  최재우  여의도

## 행열 검색하기

### 열(column) 검색

In [14]:
data.head(1)

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남

In [17]:
data['몸무게']

회차
1    76.4
2    75.7
3    76.0
4     NaN
5    76.2
6    75.7
7     NaN
8     NaN
9    75.0
Name: 몸무게, dtype: float64

In [18]:
data['지점']

회차
1     강남
2     강남
3     강남
4    여의도
5    강남구
6    여의도
7    여의도
8    여의도
9    여의도
Name: 지점, dtype: object

In [23]:
# data[['이름', '지점']]   # 두 개 이상 사용할 때는 [[]], 안쪽 중괄호가 list
cols=['이름', '지점']
data[cols]

     이름   지점
회차
1   강성희   강남
2   강성희   강남
3   강성희   강남
4   강성희  여의도
5   강성희  강남구
6   강성희  여의도
7   강성희  여의도
8   강성희  여의도
9   강성희  여의도

### 행(rows) 검색

In [25]:
# loc = location
data.loc[1]   # 여기서 1은 회차가 1,2,...로 되어 있으니까 1로 한 거다. "1회차" 이렇게 되어 있다면 "1회차"라고 하면 된다.

이름            강성희
측정일    2019-01-01
몸무게          76.4
단위             kg
담당            김지수
지점             강남
Name: 1, dtype: object

In [26]:
idx = [1,2,3]
data.loc[idx]

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남
2   강성희  2019-01-02  75.7  kg  김지수  강남
3   강성희  2019-01-03  76.0  kg  김지수  강남

### 행열 동시검색

In [27]:
data.loc[1,"이름"]

'강성희'

In [30]:
idx = [1,2,3]
cols = ['이름','지점']

data.loc[idx, cols]

     이름  지점
회차
1   강성희  강남
2   강성희  강남
3   강성희  강남

In [32]:
idx = [2,5,6]
cols = ['이름', '지점', '담당']

data.loc[idx, cols]

     이름   지점   담당
회차
2   강성희   강남  김지수
5   강성희  강남구  김지수
6   강성희  여의도  최재우

## 기본기능

In [33]:
data['몸무게']

회차
1    76.4
2    75.7
3    76.0
4     NaN
5    76.2
6    75.7
7     NaN
8     NaN
9    75.0
Name: 몸무게, dtype: float64

In [34]:
data['몸무게'].mean()

75.83333333333333

In [35]:
data['몸무게'].max()

76.4

In [36]:
data['몸무게'].min()

75.0

In [37]:
data['몸무게'].std()

0.4926120853842992

In [39]:
data['몸무게'].quantile(0.75)

76.15

In [43]:
data['지점']

회차
1     강남
2     강남
3     강남
4    여의도
5    강남구
6    여의도
7    여의도
8    여의도
9    여의도
Name: 지점, dtype: object

In [41]:
data['지점'].replace('강남구', '강남')

회차
1     강남
2     강남
3     강남
4    여의도
5     강남
6    여의도
7    여의도
8    여의도
9    여의도
Name: 지점, dtype: object

In [42]:
data['지점']   # 원본은 바꾸지 않는다

회차
1     강남
2     강남
3     강남
4    여의도
5    강남구
6    여의도
7    여의도
8    여의도
9    여의도
Name: 지점, dtype: object

In [48]:
data['지점'] = data['지점'].replace('강남구', '강남')   # 원본에 덮어씌운다
data['지점']

회차
1     강남
2     강남
3     강남
4    여의도
5     강남
6    여의도
7    여의도
8    여의도
9    여의도
Name: 지점, dtype: object

In [49]:
data['몸무게']

회차
1    76.4
2    75.7
3    76.0
4     NaN
5    76.2
6    75.7
7     NaN
8     NaN
9    75.0
Name: 몸무게, dtype: float64

In [50]:
# NaN = Not a Number = Null != "NaN"(string)
data['몸무게'].fillna(100)   # fillna = Fill NaN

회차
1     76.4
2     75.7
3     76.0
4    100.0
5     76.2
6     75.7
7    100.0
8    100.0
9     75.0
Name: 몸무게, dtype: float64

## 색인(indexing)

In [51]:
data.head(1)

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남

In [55]:
data['담당'] == '김지수'

회차
1     True
2     True
3     True
4    False
5     True
6    False
7    False
8    False
9    False
Name: 담당, dtype: bool

In [54]:
data[data['담당'] == '김지수']

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남
2   강성희  2019-01-02  75.7  kg  김지수  강남
3   강성희  2019-01-03  76.0  kg  김지수  강남
5   강성희  2019-01-05  76.2  kg  김지수  강남

In [56]:
data['지점'] == '강남'

회차
1     True
2     True
3     True
4    False
5     True
6    False
7    False
8    False
9    False
Name: 지점, dtype: bool

In [57]:
data['지점'] != '강남'

회차
1    False
2    False
3    False
4     True
5    False
6     True
7     True
8     True
9     True
Name: 지점, dtype: bool

In [58]:
data[data['지점'] != '강남']

     이름         측정일   몸무게  단위   담당   지점
회차
4   강성희  2019-01-04   NaN  kg  최재우  여의도
6   강성희  2019-01-06  75.7  kg  최재우  여의도
7   강성희  2019-01-07   NaN  kg  최재우  여의도
8   강성희  2019-01-08   NaN  kg  김민철  여의도
9   강성희  2019-01-09  75.0  kg  김민철  여의도

In [59]:
data[data['몸무게'] > 76]   # 검색 -> True/False -> filter

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남
3   강성희  2019-01-03  76.0  kg  김지수  강남
5   강성희  2019-01-05  76.2  kg  김지수  강남

In [60]:
(data['담당'] == '김지수') & (data['몸무게'] > 76)

회차
1     True
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
dtype: bool

In [61]:
data[(data['담당'] == '김지수') & (data['몸무게'] > 76)]

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남
5   강성희  2019-01-05  76.2  kg  김지수  강남

In [67]:
# data[(data['담당'] == '김지수') & (data['몸무게'] > 76)]
kim = (data['담당'] == '김지수')
over_weight = (data['몸무게'] > 76)
kim & over_weight
data[kim&over_weight]
data[kim|over_weight]

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남
2   강성희  2019-01-02  75.7  kg  김지수  강남
3   강성희  2019-01-03  76.0  kg  김지수  강남
5   강성희  2019-01-05  76.2  kg  김지수  강남

In [68]:
data.loc[kim|over_weight]   # loc 붙이나 안 붙이나 결과는 동일하다

     이름         측정일   몸무게  단위   담당  지점
회차
1   강성희  2019-01-01  76.4  kg  김지수  강남
2   강성희  2019-01-02  75.7  kg  김지수  강남
3   강성희  2019-01-03  76.0  kg  김지수  강남
5   강성희  2019-01-05  76.2  kg  김지수  강남

In [71]:
data.loc[kim|over_weight, ['이름','지점']]

col = ['이름','지점']
data.loc[kim|over_weight, col]

     이름  지점
회차
1   강성희  강남
2   강성희  강남
3   강성희  강남
5   강성희  강남

In [72]:
data['몸무게'].isnull()

회차
1    False
2    False
3    False
4     True
5    False
6    False
7     True
8     True
9    False
Name: 몸무게, dtype: bool

In [73]:
data[data['몸무게'].isnull()]

     이름         측정일  몸무게  단위   담당   지점
회차
4   강성희  2019-01-04  NaN  kg  최재우  여의도
7   강성희  2019-01-07  NaN  kg  최재우  여의도
8   강성희  2019-01-08  NaN  kg  김민철  여의도

In [76]:
cols = ['이름', '몸무게', '지점']
data.loc[data['몸무게'].isnull(), cols]
data.loc[data['몸무게'].notnull(), cols]
data.loc[~data['몸무게'].isnull(), cols]

     이름   몸무게   지점
회차
1   강성희  76.4   강남
2   강성희  75.7   강남
3   강성희  76.0   강남
5   강성희  76.2   강남
6   강성희  75.7  여의도
9   강성희  75.0  여의도

## 행열 추가/수정

In [84]:
data['날씨'] = '좋음'
data
data['날씨'] = '나쁨'
data

     이름         측정일   몸무게  단위   담당   지점  날씨
회차
1   강성희  2019-01-01  76.4  kg  김지수   강남  나쁨
2   강성희  2019-01-02  75.7  kg  김지수   강남  나쁨
3   강성희  2019-01-03  76.0  kg  김지수   강남  나쁨
4   강성희  2019-01-04   NaN  kg  최재우  여의도  나쁨
5   강성희  2019-01-05  76.2  kg  김지수   강남  나쁨
6   강성희  2019-01-06  75.7  kg  최재우  여의도  나쁨
7   강성희  2019-01-07   NaN  kg  최재우  여의도  나쁨
8   강성희  2019-01-08   NaN  kg  김민철  여의도  나쁨
9   강성희  2019-01-09  75.0  kg  김민철  여의도  나쁨

In [86]:
data['결제여부'] = [True, True, False, True, True, True, False, False, True]   # 개수가 안 맞으면 에러난다
data

     이름         측정일   몸무게  단위   담당   지점  날씨   결제여부
회차
1   강성희  2019-01-01  76.4  kg  김지수   강남  나쁨   True
2   강성희  2019-01-02  75.7  kg  김지수   강남  나쁨   True
3   강성희  2019-01-03  76.0  kg  김지수   강남  나쁨  False
4   강성희  2019-01-04   NaN  kg  최재우  여의도  나쁨   True
5   강성희  2019-01-05  76.2  kg  김지수   강남  나쁨   True
6   강성희  2019-01-06  75.7  kg  최재우  여의도  나쁨   True
7   강성희  2019-01-07   NaN  kg  최재우  여의도  나쁨  False
8   강성희  2019-01-08   NaN  kg  김민철  여의도  나쁨  False
9   강성희  2019-01-09  75.0  kg  김민철  여의도  나쁨   True

In [90]:
data['과체중'] = (data['몸무게'] > 76)
cols = ['몸무게', '과체중']
data[cols].head()

     몸무게    과체중
회차
1   76.4   True
2   75.7  False
3   76.0  False
4    NaN  False
5   76.2   True

In [97]:
# 상태
data.loc[data['몸무게'] > 76, "상태"] = '과체중'
cols = ['몸무게', '상태']
data[cols].head()

     몸무게   상태
회차
1   76.4  과체중
2   75.7  NaN
3   76.0  NaN
4    NaN  NaN
5   76.2  과체중

In [99]:
data.loc[~(data['몸무게'] > 76), "상태"] = '정상체중'
cols = ['몸무게', '상태']
data[cols].head()

     몸무게    상태
회차
1   76.4   과체중
2   75.7  정상체중
3   76.0  정상체중
4    NaN  정상체중
5   76.2   과체중

In [100]:
data.loc[data['몸무게'].isnull(), "상태"] = 'N/A'
cols = ['몸무게', '상태']
data[cols].head()

     몸무게    상태
회차
1   76.4   과체중
2   75.7  정상체중
3   76.0  정상체중
4    NaN   N/A
5   76.2   과체중